Masmiseim36/Kinetis/targets/Kinetis/SVD/MK40N512MD100.svd.xml
        <register>
          <name>SOPT6</name>
          <description>System Options Register 6</description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTFLTSEL</name>
              <description>Reset pin filter select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00000</name>
                  <description>Bus clock filter count is 1</description>
                  <value>#00000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00001</name>
                  <description>Bus clock filter count is 2</description>
                  <value>#00001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00010</name>
                  <description>Bus clock filter count is 3</description>
                  <value>#00010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00011</name>
                  <description>Bus clock filter count is 4</description>
                  <value>#00011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00100</name>
                  <description>Bus clock filter count is 5</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>Bus clock filter count is 6</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>Bus clock filter count is 7</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111</name>
                  <description>Bus clock filter count is 8</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01000</name>
                  <description>Bus clock filter count is 9</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>Bus clock filter count is 10</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01010</name>
                  <description>Bus clock filter count is 11</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01011</name>
                  <description>Bus clock filter count is 12</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>Bus clock filter count is 13</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>Bus clock filter count is 14</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>Bus clock filter count is 15</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>Bus clock filter count is 16</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>Bus clock filter count is 17</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>Bus clock filter count is 18</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>Bus clock filter count is 19</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>Bus clock filter count is 20</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10100</name>
                  <description>Bus clock filter count is 21</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10101</name>
                  <description>Bus clock filter count is 22</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10110</name>
                  <description>Bus clock filter count is 23</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10111</name>
                  <description>Bus clock filter count is 24</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11000</name>
                  <description>Bus clock filter count is 25</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11001</name>
                  <description>Bus clock filter count is 26</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11010</name>
                  <description>Bus clock filter count is 27</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11011</name>
                  <description>Bus clock filter count is 28</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11100</name>
                  <description>Bus clock filter count is 29</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11101</name>
                  <description>Bus clock filter count is 30</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>Bus clock filter count is 31</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>Bus clock filter count is 32</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTFLTEN</name>
              <description>Reset pin filter enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>All filtering disabled</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Bus clock filter enabled for normal operation. LPO clock filter enabled for stop mode.</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>LPO clock filter enabled</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Bus clock filter enabled for normal operation. All filtering disabled for stop mode.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>LPO clock filter enabled for normal operation. All filtering disabled for stop mode.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Reserved (all filtering disabled)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>Reserved (all filtering disabled)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>Reserved (all filtering disabled)</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOPT7</name>
          <description>System Options Register 7</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC0TRGSEL</name>
              <description>ADC0 trigger select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>PDB external trigger pin input (PDB0_EXTRG)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>High speed comparator 0 output</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>High speed comparator 1 output</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>High speed comparator 2 output</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>PIT trigger 0</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>PIT trigger 1</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>PIT trigger 2</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>PIT trigger 3</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>FTM0 trigger</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>FTM1 trigger</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>FTM2 trigger</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Unused</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>RTC alarm</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>RTC seconds</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Low-power timer trigger</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Unused</description>
                  <value>#1011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0PRETRGSEL</name>
              <description>ADC0 pretrigger select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Pre-trigger A</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Pre-trigger B</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC0ALTTRGEN</name>
              <description>ADC0 alternate trigger enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PDB trigger selected for ADC0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Alternate trigger selected for ADC0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1TRGSEL</name>
              <description>ADC1 trigger select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>PDB external trigger pin input (PDB0_EXTRG)</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>High speed comparator 0 output</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>High speed comparator 1 output</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>High speed comparator 2 output</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>PIT trigger 0</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>PIT trigger 1</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>PIT trigger 2</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>PIT trigger 3</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>FTM0 trigger</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>FTM1 trigger</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Unused</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>RTC alarm</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>RTC seconds</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Low-power timer trigger</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Unused</description>
                  <value>#1011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1PRETRGSEL</name>
              <description>ADC1 pre-trigger select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Pre-trigger A selected for ADC1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Pre-trigger B selected for ADC1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1ALTTRGEN</name>
              <description>ADC1 alternate trigger enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PDB trigger selected for ADC1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Alternate trigger selected for ADC1 as defined by ADC1TRGSEL.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
